//1. Принцип алгоритма Флойда - Уоршелла
//2. Какова асимптотическая оценка времени работы алгоритма Флойда–Уоршелла ?
//3. В каких случаях алгоритм Флойда–Уоршелла эффективнее алгоритма Дейкстры ?
//4. Может ли алгоритм Флойда–Уоршелла работать с отрицательными весами  и циклами ?
//5. В чём суть "треугольного оператора" в алгоритме Флойда - Уоршелла ?
//6. Что обозначает $d_{ i,j } ^ m$ ?
//7. Что такое матрица $D ^ m$ и как она формируется на основе матрицы $D^ { m - 1 }$ ?
#include <iostream>
#include <climits>

using namespace std;

const int INF = INT_MAX;

int main()
{
    system("chcp 1251");

    int D[6][6] = {
        {0, 28, 21, 59, 12, 27},
        {7, 0, 24, INF, 21, 9},
        {9, 32, 0, 13, 11, INF},
        {8, INF, 5, 0, 16, INF},
        {14, 13, 15, 10, 0, 22},
        {15, 18, INF, INF, 6, 0},
    };

    int S[6][6] = {
        {0, 2, 3, 4, 5, 6},
        {1, 0, 3, 4, 5, 6},
        {1, 2, 0, 4, 5, 6},
        {1, 2, 3, 0, 4, 6},
        {1, 2, 3, 4, 0, 6},
        {1, 2, 3, 4, 5, 0},
    };

    for (int i = 0; i < 6; i++) {

        for (int j = 0; j < 6; j++) {

            for (int k = 0; k < 6; k++) {

                if (D[j][i] != INF && D[i][k] != INF && D[j][i] + D[i][k] < D[j][k]) {
                    D[j][k] = D[j][i] + D[i][k];
                    S[j][k] = S[j][i];
                }
            }
        }
    }

    cout << "Матрица D: " << endl;
    for (int i = 0; i < 6; i++) {

        for (int j = 0; j < 6; j++) {

            if (D[i][j] == INF) {
                cout << "INF\t";
            }
            else {
                cout << D[i][j] << "\t";
            }
        }
        cout << endl;
    }

    cout << "Матрица S: " << endl;
    for (int i = 0; i < 6; i++) {

        for (int j = 0; j < 6; j++) {

            cout << S[i][j] << "\t";
        }
        cout << endl;
    }

    return 0;
}